Files/Cursos/Pract-ethic-hack/Python/Python.org
#+title: Python

[[file:~/org/Files/Cursos/Pract-ethic-hack/PracIndex.org][Índice]]

* Python
** Shebangs y Strings
Siempre que hagamos un script en python tenemos que incluir una
/shebang/ al inicio del script, esta le dira al script la dirección del
interprete de python.

#+begin_src python
#! /bin/python #shebang

#Print hello world
print("hello, world!")
print('hello, world!')
print('\n') # salto de linea
print("""hellooo,
world""") # hacky multiline string

print("This string is " + "awesome") #conatenation
#+end_src

De esta manera podremos ejecutarlo haciendo =./nombre_del_script.py=

** Math
Python es muy bueno para trabajar con números.

#+begin_src python
#! /bin/python

print(50 + 50) #add
print(50 - 50) #substract
print(50 * 50) #multiply
print(50 / 50) #divide
print(50 ** 50) #50^50
print(50 % 50) #modulo
print(50 // 50) #div sin decimales
#+end_src

** Variables y métodos
#+begin_src python
#! /bin/python

#variables y métodos
quote = "All is fair in love and war." # variable
print(quote.upper()) # hacemos el string mayus con un el método upper()

print(len(quote))

name = "Health" #string str()
age = 30 # integer int()
gpa = 3.7 # float float()

print(int(gpa)) # con esto quitaremos los decimales de la variable gpa haciendolo un integer

print("My name is "+ name +"and I am "+ str(age) +"years old.") #solo podremos concatenar strings

age += 1 # age + 1, equivalente a `age = age + 1`
#+end_src

