Publ/Cursos/Pract-ethic-hack/Python/Python.html
<!doctype html>
<html lang="en">
<head>
<title>Python</title>
<!-- 2022-01-25 Tue 18:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Python</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Shebangs y Strings</a></li>
<li><a href="#sec-1-2">1.2. Math</a></li>
<li><a href="#sec-1-3">1.3. Variables y métodos</a></li>
<li><a href="#sec-1-4">1.4. Funciones</a></li>
<li><a href="#sec-1-5">1.5. Booleans</a></li>
<li><a href="#sec-1-6">1.6. Operadores Relacionales y booleanos</a></li>
<li><a href="#sec-1-7">1.7. Condicionales</a></li>
<li><a href="#sec-1-8">1.8. listas</a></li>
<li><a href="#sec-1-9">1.9. Tuples</a></li>
<li><a href="#sec-1-10">1.10. Importing Modules</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Strings avanzados</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Diccionarios</a></li>
<li><a href="#sec-2-2">2.2. Sockets</a></li>
<li><a href="#sec-2-3">2.3. Mini Port Scaner con python</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Python</h1>
<p>
<a href="file:///home/jdemc/org/Files/Cursos/Pract-ethic-hack/PracIndex.html">Índice</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Python</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Shebangs y Strings</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Siempre que hagamos un script en python tenemos que incluir una
<i>shebang</i> al inicio del script, esta le dira al script la dirección del
interprete de python.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#! /bin/python #shebang</span>

<span style="color: #6272a4; font-style: italic;">#Print hello world</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"hello, world!"</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">'hello, world!'</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">'</span><span style="color: #ff79c6; font-style: italic;">\n</span><span style="color: #f1fa8c;">'</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># salto de linea</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c; font-style: italic;">"""</span><span style="color: #8995ba; font-style: italic;">hellooo,</span>
<span style="color: #8995ba; font-style: italic;">world</span><span style="color: #f1fa8c; font-style: italic;">"""</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># hacky multiline string</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"This string is "</span> <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #f1fa8c;">"awesome"</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#conatenation</span>
</pre>
</div>

<p>
De esta manera podremos ejecutarlo haciendo <code>./nombre_del_script.py</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Math</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Python es muy bueno para trabajar con números.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#! /bin/python</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#add</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">-</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#substract</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">*</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#multiply</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">/</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#divide</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">**</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#50^50</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">%</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#modulo</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span> <span style="color: #ff79c6; font-style: italic;">//</span> <span style="color: #8be9fd;">50</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#div sin decimales</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Variables y métodos</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#! /bin/python</span>

<span style="color: #6272a4; font-style: italic;">#variables y m&#233;todos</span>
<span style="color: #ffc9e8;">quote</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"All is fair in love and war."</span> <span style="color: #6272a4; font-style: italic;"># variable</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>quote.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">upper</span><span style="color: #ff79c6;">()</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># hacemos el string mayus con un el m&#233;todo upper()</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #ffb86c; font-weight: bold;">len</span><span style="color: #ff79c6;">(</span>quote<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #ffc9e8;">name</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"Health"</span> <span style="color: #6272a4; font-style: italic;">#string str()</span>
<span style="color: #ffc9e8;">age</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">30</span> <span style="color: #6272a4; font-style: italic;"># integer int()</span>
<span style="color: #ffc9e8;">gpa</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">3.7</span> <span style="color: #6272a4; font-style: italic;"># float float()</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #ffb86c; font-weight: bold;">int</span><span style="color: #ff79c6;">(</span>gpa<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># con esto quitaremos los decimales de la variable gpa haciendolo un integer</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"My name is "</span><span style="color: #ff79c6; font-style: italic;">+</span> name <span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #f1fa8c;">"and I am "</span><span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #ffb86c; font-weight: bold;">str</span><span style="color: #ff79c6;">(</span>age<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #f1fa8c;">"years old."</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#solo podremos concatenar strings</span>

<span style="color: #ffc9e8;">age</span> <span style="color: #ff79c6; font-style: italic;">+=</span> <span style="color: #8be9fd;">1</span> <span style="color: #6272a4; font-style: italic;"># age + 1, equivalente a `age = age + 1`</span>
</pre>
</div>
</div>
</div>
