Files/Cursos/Pract-ethic-hack/Python/Python.org
** Funciones
Como pequeños trozos de código que podemos llamar cuando necesitemos.

#+begin_src python

def who_am_i(): # definimos una función
    name = "Health"
    age = 30
    gpa = 3.7
    print("My name is "+ name +"and I am "+ str(age) +"years old.")

who_am_i() # llamamos a la función

#añadiendo parámetros
def add_one_hundred(num):
    print(num + 100)

add_one_hundred(100)

#múltiples parámetros
def add(x,y):
    print(x+y)

add(7,7)


def multiply(x,y):
    return (x*y) # aquí retornamos el resultado, para que otra función o método pueda usarlo

print(multiply(7,7)
#+end_src

** Booleans
#+begin_src python
bool1 = True
bool2 = 3*3 == 9 #True
bool3 = False
bool4 = 3*3 != 9

print(bool1, bool2, bool3, bool4)
# True True False False
print(type(bool1))
#+end_src

** Operadores Relacionales y booleanos
#+begin_src python
greater_than = 7 >      #all true
less_than = 5 < 7
greater_than_equal + 7 >= 7
less_than_equal_to 7 <= 7

test_and = (7 > 5) and (5 < 7)  #true
test_and2 = (7 > 5) and (5 > 7)  #false
test_or = (7 > 5) or (5 < 7)  #true
test_or2 = (7 > 5) or (5 > 7)  #true

test_not = not True #false
#+end_src

** Condicionales
#+begin_src python
def drink(money):
    if money >= 2:
        return "You've got yourself a drink"
    else:
        return "NO drink for you"

def alcohol(age,money):
    if (age >= 21) and (money >= 5):
        return "We're getting a drink!"
    elif (age >= 21) and (money < 5):
        return "Come back with more money"
    elif (age < 21) and (money >= 5):
        return "Nice Try, kid!"
    else:
        return "You're too poor and too young"
print(drink(3))
print(alcohol(21,5))
#+end_src

