Publ/Cursos/Pract-ethic-hack/Python/Python.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Funciones</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Como pequeños trozos de código que podemos llamar cuando necesitemos.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff79c6; font-style: italic;">def</span> <span style="color: #50fa7b;">who_am_i</span><span style="color: #61bfff;">()</span>: <span style="color: #6272a4; font-style: italic;"># definimos una funci&#243;n</span>
    <span style="color: #ffc9e8;">name</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"Health"</span>
    <span style="color: #ffc9e8;">age</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">30</span>
    <span style="color: #ffc9e8;">gpa</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">3.7</span>
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"My name is "</span><span style="color: #ff79c6; font-style: italic;">+</span> name <span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #f1fa8c;">"and I am "</span><span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #ffb86c; font-weight: bold;">str</span><span style="color: #ff79c6;">(</span>age<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #f1fa8c;">"years old."</span><span style="color: #61bfff;">)</span>

<span style="color: #bd93f9; font-weight: bold;">who_am_i</span><span style="color: #61bfff;">()</span> <span style="color: #6272a4; font-style: italic;"># llamamos a la funci&#243;n</span>

<span style="color: #6272a4; font-style: italic;">#a&#241;adiendo par&#225;metros</span>
<span style="color: #ff79c6; font-style: italic;">def</span> <span style="color: #50fa7b;">add_one_hundred</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">num</span><span style="color: #61bfff;">)</span>:
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>num <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #8be9fd;">100</span><span style="color: #61bfff;">)</span>

<span style="color: #bd93f9; font-weight: bold;">add_one_hundred</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">100</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4; font-style: italic;">#m&#250;ltiples par&#225;metros</span>
<span style="color: #ff79c6; font-style: italic;">def</span> <span style="color: #50fa7b;">add</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">x</span>,<span style="color: #ffc9e8;">y</span><span style="color: #61bfff;">)</span>:
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>x<span style="color: #ff79c6; font-style: italic;">+</span>y<span style="color: #61bfff;">)</span>

<span style="color: #bd93f9; font-weight: bold;">add</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">7</span>,<span style="color: #8be9fd;">7</span><span style="color: #61bfff;">)</span>


<span style="color: #ff79c6; font-style: italic;">def</span> <span style="color: #50fa7b;">multiply</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">x</span>,<span style="color: #ffc9e8;">y</span><span style="color: #61bfff;">)</span>:
    <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #61bfff;">(</span>x<span style="color: #ff79c6; font-style: italic;">*</span>y<span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># aqu&#237; retornamos el resultado, para que otra funci&#243;n o m&#233;todo pueda usarlo</span>

print<span style="color: #61bfff;">(</span><span style="color: #bd93f9; font-weight: bold;">multiply</span><span style="color: #ff79c6;">(</span><span style="color: #8be9fd;">7</span>,<span style="color: #8be9fd;">7</span><span style="color: #ff79c6;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Booleans</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ffc9e8;">bool1</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #ffb86c;">True</span>
<span style="color: #ffc9e8;">bool2</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">3</span><span style="color: #ff79c6; font-style: italic;">*</span><span style="color: #8be9fd;">3</span> <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">9</span> <span style="color: #6272a4; font-style: italic;">#True</span>
<span style="color: #ffc9e8;">bool3</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #ffb86c;">False</span>
<span style="color: #ffc9e8;">bool4</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">3</span><span style="color: #ff79c6; font-style: italic;">*</span><span style="color: #8be9fd;">3</span> <span style="color: #ff79c6; font-style: italic;">!=</span> <span style="color: #8be9fd;">9</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>bool1, bool2, bool3, bool4<span style="color: #61bfff;">)</span>
<span style="color: #6272a4; font-style: italic;"># True True False False</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #ffb86c; font-weight: bold;">type</span><span style="color: #ff79c6;">(</span>bool1<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Operadores Relacionales y booleanos</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ffc9e8;">greater_than</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span>      <span style="color: #6272a4; font-style: italic;">#all true</span>
less_than <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">5</span> <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">7</span>
greater_than_equal <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&gt;=</span> <span style="color: #8be9fd;">7</span>
less_than_equal_to <span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&lt;=</span> <span style="color: #8be9fd;">7</span>

<span style="color: #ffc9e8;">test_and</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">and</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">5</span> <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">7</span><span style="color: #61bfff;">)</span>  <span style="color: #6272a4; font-style: italic;">#true</span>
<span style="color: #ffc9e8;">test_and2</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">and</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">5</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">7</span><span style="color: #61bfff;">)</span>  <span style="color: #6272a4; font-style: italic;">#false</span>
<span style="color: #ffc9e8;">test_or</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">or</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">5</span> <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">7</span><span style="color: #61bfff;">)</span>  <span style="color: #6272a4; font-style: italic;">#true</span>
<span style="color: #ffc9e8;">test_or2</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">7</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">or</span> <span style="color: #61bfff;">(</span><span style="color: #8be9fd;">5</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">7</span><span style="color: #61bfff;">)</span>  <span style="color: #6272a4; font-style: italic;">#true</span>

<span style="color: #ffc9e8;">test_not</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #ff79c6; font-style: italic;">not</span> <span style="color: #ffb86c;">True</span> <span style="color: #6272a4; font-style: italic;">#false</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Condicionales</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff79c6; font-style: italic;">def</span> <span style="color: #50fa7b;">drink</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">money</span><span style="color: #61bfff;">)</span>:
    <span style="color: #ff79c6; font-style: italic;">if</span> money <span style="color: #ff79c6; font-style: italic;">&gt;=</span> <span style="color: #8be9fd;">2</span>:
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"You've got yourself a drink"</span>
    <span style="color: #ff79c6; font-style: italic;">else</span>:
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"NO drink for you"</span>

<span style="color: #ff79c6; font-style: italic;">def</span> <span style="color: #50fa7b;">alcohol</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">age</span>,<span style="color: #ffc9e8;">money</span><span style="color: #61bfff;">)</span>:
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff;">(</span>age <span style="color: #ff79c6; font-style: italic;">&gt;=</span> <span style="color: #8be9fd;">21</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">and</span> <span style="color: #61bfff;">(</span>money <span style="color: #ff79c6; font-style: italic;">&gt;=</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span>:
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"We're getting a drink!"</span>
    <span style="color: #ff79c6; font-style: italic;">elif</span> <span style="color: #61bfff;">(</span>age <span style="color: #ff79c6; font-style: italic;">&gt;=</span> <span style="color: #8be9fd;">21</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">and</span> <span style="color: #61bfff;">(</span>money <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span>:
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"Come back with more money"</span>
    <span style="color: #ff79c6; font-style: italic;">elif</span> <span style="color: #61bfff;">(</span>age <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">21</span><span style="color: #61bfff;">)</span> <span style="color: #ff79c6; font-style: italic;">and</span> <span style="color: #61bfff;">(</span>money <span style="color: #ff79c6; font-style: italic;">&gt;=</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff;">)</span>:
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"Nice Try, kid!"</span>
    <span style="color: #ff79c6; font-style: italic;">else</span>:
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #f1fa8c;">"You're too poor and too young"</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #bd93f9; font-weight: bold;">drink</span><span style="color: #ff79c6;">(</span><span style="color: #8be9fd;">3</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #bd93f9; font-weight: bold;">alcohol</span><span style="color: #ff79c6;">(</span><span style="color: #8be9fd;">21</span>,<span style="color: #8be9fd;">5</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
