Files/Cursos/Pract-ethic-hack/Python/Python.org
** listas
Listas mutables

#+begin_src python
#list - have brackets []
movies = ["When Harry Met Sally","The Hangover","The Perks of Being a Wallflower","The exorcist"]

print(movies[0]) # el primer elemento es el 0
print(movies[1:3]) # los items del 1 al 3
print(movies[1:]) # los items del 1 al último
print(movies[:2]) # del primero hasta el 2
print(movies[-1]) # El último item
print(len(movies)) # la longitud de la lisa
movies.append("JAWS")# agregar elementos a la lista
movies.pop() #Retorna y elimina el último elemento de la lista
#+end_src

** Tuples
Listas no mutables

#+begin_src python
#Tuples - Do not change, ()
grades=("a","b","c","d","f")
print(grades[1]))
#+end_src

** Importing Modules
#+begin_src python
#! /bin/python
import sys # para funciones del sistema (importante)
import os  #
from datetime import datetime #podemos importar solo un metodo
from datetime import datetime as dt # o lo podemos importar con un alias.

print(sys.version)
print(datetime.now())
print(dt.now()) # usndo el alias
#+end_src

* Strings avanzados
#+begin_src python
my_name = "Health"
print(my_name[0]) # imprimimos solo la primera letra
print(my_name[-1]) # imprimimos solo la última letra

sentence = "This is a sentence"
print(sentence[:4])

sentence_join = sentence.split(" ")# separamos el string en cada " "

sentence_join = ' '.join(sentence_join)# unimos la oración de nuevo
print(sentence_join)

quote = "he said, \"give me all your money\"" # \ hace que ignore los carateres
print(quote)

too_much_space="            hello       "
print(too_much_space.strip())# quita los espacios, el " " viene inplicito, le posemos dar cualquier arg

print("a" in "Apple") # FALSE

letter = "A"
word = "Apple"
print(letter.lower() in world.lower())# improved

movie="The Hangover"
print("My favorite movie is "+movie+".")
print("My favorite movie is {}.".format(movie))#usando un placeholder
#+end_src

