Publ/Cursos/Pract-ethic-hack/Python/Python.html

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> listas</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Listas mutables
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#list - have brackets []</span>
<span style="color: #ffc9e8;">movies</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff;">[</span><span style="color: #f1fa8c;">"When Harry Met Sally"</span>,<span style="color: #f1fa8c;">"The Hangover"</span>,<span style="color: #f1fa8c;">"The Perks of Being a Wallflower"</span>,<span style="color: #f1fa8c;">"The exorcist"</span><span style="color: #61bfff;">]</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>movies<span style="color: #ff79c6;">[</span><span style="color: #8be9fd;">0</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># el primer elemento es el 0</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>movies<span style="color: #ff79c6;">[</span><span style="color: #8be9fd;">1</span>:<span style="color: #8be9fd;">3</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># los items del 1 al 3</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>movies<span style="color: #ff79c6;">[</span><span style="color: #8be9fd;">1</span>:<span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># los items del 1 al &#250;ltimo</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>movies<span style="color: #ff79c6;">[</span>:<span style="color: #8be9fd;">2</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># del primero hasta el 2</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>movies<span style="color: #ff79c6;">[</span><span style="color: #ff79c6; font-style: italic;">-</span><span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># El &#250;ltimo item</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #ffb86c; font-weight: bold;">len</span><span style="color: #ff79c6;">(</span>movies<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># la longitud de la lisa</span>
movies.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">append</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"JAWS"</span><span style="color: #61bfff;">)</span><span style="color: #6272a4; font-style: italic;"># agregar elementos a la lista</span>
movies.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">pop</span><span style="color: #61bfff;">()</span> <span style="color: #6272a4; font-style: italic;">#Retorna y elimina el &#250;ltimo elemento de la lista</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Tuples</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Listas no mutables
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#Tuples - Do not change, ()</span>
<span style="color: #ffc9e8;">grades</span><span style="color: #ff79c6; font-style: italic;">=</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"a"</span>,<span style="color: #f1fa8c;">"b"</span>,<span style="color: #f1fa8c;">"c"</span>,<span style="color: #f1fa8c;">"d"</span>,<span style="color: #f1fa8c;">"f"</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>grades<span style="color: #ff79c6;">[</span><span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span><span style="color: #ff5555; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Importing Modules</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#! /bin/python</span>
<span style="color: #ff79c6; font-style: italic;">import</span> sys <span style="color: #6272a4; font-style: italic;"># para funciones del sistema (importante)</span>
<span style="color: #ff79c6; font-style: italic;">import</span> os  <span style="color: #6272a4; font-style: italic;">#</span>
<span style="color: #ff79c6; font-style: italic;">from</span> datetime <span style="color: #ff79c6; font-style: italic;">import</span> datetime <span style="color: #6272a4; font-style: italic;">#podemos importar solo un metodo</span>
<span style="color: #ff79c6; font-style: italic;">from</span> datetime <span style="color: #ff79c6; font-style: italic;">import</span> datetime <span style="color: #ff79c6; font-style: italic;">as</span> dt <span style="color: #6272a4; font-style: italic;"># o lo podemos importar con un alias.</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>sys.<span style="color: #8be9fd; font-style: italic;">version</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>datetime.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">now</span><span style="color: #ff79c6;">()</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>dt.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">now</span><span style="color: #ff79c6;">()</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># usndo el alias</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Strings avanzados</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ffc9e8;">my_name</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"Health"</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>my_name<span style="color: #ff79c6;">[</span><span style="color: #8be9fd;">0</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># imprimimos solo la primera letra</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>my_name<span style="color: #ff79c6;">[</span><span style="color: #ff79c6; font-style: italic;">-</span><span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># imprimimos solo la &#250;ltima letra</span>

<span style="color: #ffc9e8;">sentence</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"This is a sentence"</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>sentence<span style="color: #ff79c6;">[</span>:<span style="color: #8be9fd;">4</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span>

<span style="color: #ffc9e8;">sentence_join</span> <span style="color: #ff79c6; font-style: italic;">=</span> sentence.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">split</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">" "</span><span style="color: #61bfff;">)</span><span style="color: #6272a4; font-style: italic;"># separamos el string en cada " "</span>

<span style="color: #ffc9e8;">sentence_join</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">' '</span>.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">join</span><span style="color: #61bfff;">(</span>sentence_join<span style="color: #61bfff;">)</span><span style="color: #6272a4; font-style: italic;"># unimos la oraci&#243;n de nuevo</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>sentence_join<span style="color: #61bfff;">)</span>

<span style="color: #ffc9e8;">quote</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"he said, </span><span style="color: #ff79c6; font-style: italic;">\"</span><span style="color: #f1fa8c;">give me all your money</span><span style="color: #ff79c6; font-style: italic;">\"</span><span style="color: #f1fa8c;">"</span> <span style="color: #6272a4; font-style: italic;"># \ hace que ignore los carateres</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>quote<span style="color: #61bfff;">)</span>

<span style="color: #ffc9e8;">too_much_space</span><span style="color: #ff79c6; font-style: italic;">=</span><span style="color: #f1fa8c;">"            hello       "</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>too_much_space.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">strip</span><span style="color: #ff79c6;">()</span><span style="color: #61bfff;">)</span><span style="color: #6272a4; font-style: italic;"># quita los espacios, el " " viene inplicito, le posemos dar cualquier arg</span>

<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"a"</span> <span style="color: #ff79c6; font-style: italic;">in</span> <span style="color: #f1fa8c;">"Apple"</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;"># FALSE</span>

<span style="color: #ffc9e8;">letter</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"A"</span>
<span style="color: #ffc9e8;">word</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">"Apple"</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>letter.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">lower</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6; font-style: italic;">in</span> world.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">lower</span><span style="color: #ff79c6;">()</span><span style="color: #61bfff;">)</span><span style="color: #6272a4; font-style: italic;"># improved</span>

<span style="color: #ffc9e8;">movie</span><span style="color: #ff79c6; font-style: italic;">=</span><span style="color: #f1fa8c;">"The Hangover"</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"My favorite movie is "</span><span style="color: #ff79c6; font-style: italic;">+</span>movie<span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #f1fa8c;">"."</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"My favorite movie is {}."</span>.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">format</span><span style="color: #ff79c6;">(</span>movie<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span><span style="color: #6272a4; font-style: italic;">#usando un placeholder</span>
</pre>
</div>
</div>
