Files/Cursos/Pract-ethic-hack/Python/Python.org
** Diccionarios
#+begin_src python
#Diccionarios - key/value {}
drink={"White Russian":7, "Old Fashion": 10, "Lemon Drop": 8}#drink=key price=value
print(drink)
employees={"Finance":["bob","Linda","Tina"], "IT":["Gene","Louse","Teddy"], "HR":["Jimmy","Mort"]}
print(employees)

employees["Legal"] = ["Mr. Frond"]# add a new key: value pair
print(employees)

employees.update({"Sales": ["Andie","Ollie"]#same
print(employees)

drink["White Russian"] = 8

print(drink.get("White Russian")
#+end_src

** Sockets
creamos un nuevo archivo

#+begin_src python
#! /bin/python

import socket

HOST = `127.0.0.1`#local host
PORT = 7777

s = socket.socket(socket.AF_INET, socket.SOCK_STREAM) #Declaramos todo en s.
# AF_INET = IPv4, SOCK_STREAM = PORT
s.connect((HOST, PORT))

#Con esto hacemos una conección con la IP y el puerto dados
#+end_src

** Mini Port Scaner con python
Terrible pero funcional scaner de puertos

#+begin_src python
#! /bin/python
import sys
import socket
from datetime import datetime

#define our target
if len(sys.argv)==2:
    target=socket.gethostbyname(sys.argv[1]) #Translating hostname to IPv4
else:
    print("Invalid amount of arguments. ")
    print("Syntax: python scaner.py <ip>")

#adding a pretty banner
print("-" * 30)
print("Scanning target "+target)
print("Tie started: "+srt(datetime.now()))
print("-" * 30)

try:
    for port in range(50,85):#esto no es bueno, tarda mucho, add concurrencia
        s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
        socket.setdefaulttimeout(1)
        result = s.connect_ex((target,port)) #returns an error indicator
        if result == 0:
            print("Port {} is open".format(port))
        s.close()
except KeyboardInterrupt:
    print("\nExiting program. ")
    sys.exit()

except socket.gaierror:
    print("Hostname could not be resolved")
    sys.exit()

except socket.error:
    print("Couldn't connect to server")
    sys.exit()
#+end_src
