Publ/Cursos/Pract-ethic-hack/Python/Python.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Diccionarios</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#Diccionarios - key/value {}</span>
<span style="color: #ffc9e8;">drink</span><span style="color: #ff79c6; font-style: italic;">=</span><span style="color: #61bfff;">{</span><span style="color: #f1fa8c;">"White Russian"</span>:<span style="color: #8be9fd;">7</span>, <span style="color: #f1fa8c;">"Old Fashion"</span>: <span style="color: #8be9fd;">10</span>, <span style="color: #f1fa8c;">"Lemon Drop"</span>: <span style="color: #8be9fd;">8</span><span style="color: #61bfff;">}</span><span style="color: #6272a4; font-style: italic;">#drink=key price=value</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>drink<span style="color: #61bfff;">)</span>
<span style="color: #ffc9e8;">employees</span><span style="color: #ff79c6; font-style: italic;">=</span><span style="color: #61bfff;">{</span><span style="color: #f1fa8c;">"Finance"</span>:<span style="color: #ff79c6;">[</span><span style="color: #f1fa8c;">"bob"</span>,<span style="color: #f1fa8c;">"Linda"</span>,<span style="color: #f1fa8c;">"Tina"</span><span style="color: #ff79c6;">]</span>, <span style="color: #f1fa8c;">"IT"</span>:<span style="color: #ff79c6;">[</span><span style="color: #f1fa8c;">"Gene"</span>,<span style="color: #f1fa8c;">"Louse"</span>,<span style="color: #f1fa8c;">"Teddy"</span><span style="color: #ff79c6;">]</span>, <span style="color: #f1fa8c;">"HR"</span>:<span style="color: #ff79c6;">[</span><span style="color: #f1fa8c;">"Jimmy"</span>,<span style="color: #f1fa8c;">"Mort"</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">}</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>employees<span style="color: #61bfff;">)</span>

employees<span style="color: #61bfff;">[</span><span style="color: #ffc9e8;">"Legal"</span><span style="color: #61bfff;">]</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff;">[</span><span style="color: #f1fa8c;">"Mr. Frond"</span><span style="color: #61bfff;">]</span><span style="color: #6272a4; font-style: italic;"># add a new key: value pair</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span>employees<span style="color: #61bfff;">)</span>

employees.<span style="color: #8be9fd; font-style: italic;">update</span><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">{</span><span style="color: #f1fa8c;">"Sales"</span>: <span style="color: #50fa7b;">[</span><span style="color: #f1fa8c;">"Andie"</span>,<span style="color: #f1fa8c;">"Ollie"</span><span style="color: #50fa7b;">]</span><span style="color: #6272a4; font-style: italic;">#same</span>
<span style="color: #ff79c6; font-style: italic;">print</span><span style="color: #50fa7b;">(</span>employees<span style="color: #50fa7b;">)</span>

drink<span style="color: #50fa7b;">[</span><span style="color: #f1fa8c;">"White Russian"</span><span style="color: #50fa7b;">]</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">8</span>

<span style="color: #ff79c6; font-style: italic;">print</span><span style="color: #50fa7b;">(</span>drink.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">get</span><span style="color: #bd93f9;">(</span><span style="color: #f1fa8c;">"White Russian"</span><span style="color: #bd93f9;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Sockets</h3>
<div class="outline-text-3" id="text-2-2">
<p>
creamos un nuevo archivo
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#! /bin/python</span>

<span style="color: #ff79c6; font-style: italic;">import</span> socket

<span style="color: #ffc9e8;">HOST</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #f1fa8c;">`127.0.0.1`</span><span style="color: #6272a4; font-style: italic;">#local host</span>
<span style="color: #ffc9e8;">PORT</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">7777</span>

<span style="color: #ffc9e8;">s</span> <span style="color: #ff79c6; font-style: italic;">=</span> socket.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">socket</span><span style="color: #61bfff;">(</span>socket.<span style="color: #8be9fd; font-style: italic;">AF_INET</span>, socket.<span style="color: #8be9fd; font-style: italic;">SOCK_STREAM</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#Declaramos todo en s.</span>
<span style="color: #6272a4; font-style: italic;"># AF_INET = IPv4, SOCK_STREAM = PORT</span>
s.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">connect</span><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">(</span><span style="color: #8be9fd;">HOST</span>, <span style="color: #8be9fd;">PORT</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4; font-style: italic;">#Con esto hacemos una conecci&#243;n con la IP y el puerto dados</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Mini Port Scaner con python</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Terrible pero funcional scaner de puertos
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #6272a4; font-style: italic;">#! /bin/python</span>
<span style="color: #ff79c6; font-style: italic;">import</span> sys
<span style="color: #ff79c6; font-style: italic;">import</span> socket
<span style="color: #ff79c6; font-style: italic;">from</span> datetime <span style="color: #ff79c6; font-style: italic;">import</span> datetime

<span style="color: #6272a4; font-style: italic;">#define our target</span>
<span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ffb86c; font-weight: bold;">len</span><span style="color: #61bfff;">(</span>sys.<span style="color: #8be9fd; font-style: italic;">argv</span><span style="color: #61bfff;">)</span><span style="color: #ff79c6; font-style: italic;">==</span><span style="color: #8be9fd;">2</span>:
    <span style="color: #ffc9e8;">target</span><span style="color: #ff79c6; font-style: italic;">=</span>socket.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">gethostbyname</span><span style="color: #61bfff;">(</span>sys.<span style="color: #8be9fd; font-style: italic;">argv</span><span style="color: #ff79c6;">[</span><span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">]</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#Translating hostname to IPv4</span>
<span style="color: #ff79c6; font-style: italic;">else</span>:
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Invalid amount of arguments. "</span><span style="color: #61bfff;">)</span>
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Syntax: python scaner.py &lt;ip&gt;"</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4; font-style: italic;">#adding a pretty banner</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"-"</span> <span style="color: #ff79c6; font-style: italic;">*</span> <span style="color: #8be9fd;">30</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Scanning target "</span><span style="color: #ff79c6; font-style: italic;">+</span>target<span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Tie started: "</span><span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #bd93f9; font-weight: bold;">srt</span><span style="color: #ff79c6;">(</span>datetime.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">now</span><span style="color: #50fa7b;">()</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"-"</span> <span style="color: #ff79c6; font-style: italic;">*</span> <span style="color: #8be9fd;">30</span><span style="color: #61bfff;">)</span>

<span style="color: #ff79c6; font-style: italic;">try</span>:
    <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #ffc9e8;">port</span> <span style="color: #ff79c6; font-style: italic;">in</span> <span style="color: #ffb86c; font-weight: bold;">range</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">50</span>,<span style="color: #8be9fd;">85</span><span style="color: #61bfff;">)</span>:<span style="color: #6272a4; font-style: italic;">#esto no es bueno, tarda mucho, add concurrencia</span>
        <span style="color: #ffc9e8;">s</span> <span style="color: #ff79c6; font-style: italic;">=</span> socket.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">socket</span><span style="color: #61bfff;">(</span>socket.<span style="color: #8be9fd; font-style: italic;">AF_INET</span>, socket.<span style="color: #8be9fd; font-style: italic;">SOCK_STREAM</span><span style="color: #61bfff;">)</span>
        socket.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">setdefaulttimeout</span><span style="color: #61bfff;">(</span><span style="color: #8be9fd;">1</span><span style="color: #61bfff;">)</span>
        <span style="color: #ffc9e8;">result</span> <span style="color: #ff79c6; font-style: italic;">=</span> s.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">connect_ex</span><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">(</span>target,port<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4; font-style: italic;">#returns an error indicator</span>
        <span style="color: #ff79c6; font-style: italic;">if</span> result <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">0</span>:
            <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Port {} is open"</span>.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">format</span><span style="color: #ff79c6;">(</span>port<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
        s.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">close</span><span style="color: #61bfff;">()</span>
<span style="color: #ff79c6; font-style: italic;">except</span> <span style="color: #bd93f9;">KeyboardInterrupt</span>:
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"</span><span style="color: #ff79c6; font-style: italic;">\n</span><span style="color: #f1fa8c;">Exiting program. "</span><span style="color: #61bfff;">)</span>
    sys.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">exit</span><span style="color: #61bfff;">()</span>

<span style="color: #ff79c6; font-style: italic;">except</span> socket.<span style="color: #8be9fd; font-style: italic;">gaierror</span>:
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Hostname could not be resolved"</span><span style="color: #61bfff;">)</span>
    sys.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">exit</span><span style="color: #61bfff;">()</span>

<span style="color: #ff79c6; font-style: italic;">except</span> socket.<span style="color: #8be9fd; font-style: italic;">error</span>:
    <span style="color: #ffb86c; font-weight: bold;">print</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"Couldn't connect to server"</span><span style="color: #61bfff;">)</span>
    sys.<span style="color: #bd93f9; font-weight: bold; font-style: italic;">exit</span><span style="color: #61bfff;">()</span>
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-01-25 Tue 18:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
